### Module & Package

Module / Package / Library adalah kode yang sudah ada (ditulis oleh orang lain), yang bisa kita gunakan

Python memiliki:
- built-in library
- library yang harus diinstall terlebih dahulu
- library yang dapat diambil dari kode yang kita buat sendiri

In [26]:
import random

In [76]:
random.randint(1, 8)

7

In [131]:
import hitung as h

In [132]:
h.hitung_kata('aku', 'aku adalah anak gembala')

1

----

## Pandas

In [133]:
import pandas as pd

### Create a dataframe

#### Series

In [148]:
nilai = [1, 2, 3]

pd.Series(nilai)

0    1
1    2
2    3
dtype: int64

#### DataFrame

In [144]:
data = {
    "name": ["tom", "nick", "krish", "jack"],
    "age": [20, 21, 19, 18],
    "city": ["jakarta", "bandung", "jakarta", "yogyakarta"]
}

df = pd.DataFrame(data)

In [145]:
df

    name  age        city
0    tom   20     jakarta
1   nick   21     bandung
2  krish   19     jakarta
3   jack   18  yogyakarta

### Select Dataframe

In [149]:
df

    name  age        city
0    tom   20     jakarta
1   nick   21     bandung
2  krish   19     jakarta
3   jack   18  yogyakarta

In [156]:
df[['name', 'age']]

    name  age
0    tom   20
1   nick   21
2  krish   19
3   jack   18

In [160]:
df.loc[1:]

    name  age        city
1   nick   21     bandung
2  krish   19     jakarta
3   jack   18  yogyakarta

In [161]:
df[['name', 'age']].loc[2:]

    name  age
2  krish   19
3   jack   18

### Filter Dataframe

In [162]:
df

    name  age        city
0    tom   20     jakarta
1   nick   21     bandung
2  krish   19     jakarta
3   jack   18  yogyakarta

In [163]:
# filter one condition

df[(df['age'] < 20)]

    name  age        city
2  krish   19     jakarta
3   jack   18  yogyakarta

In [168]:
# filter two conditions

df[(df['age'] < 20) & (df['city'] == 'jakarta')]

    name  age     city
2  krish   19  jakarta

In [177]:
df[df['city'].str[0] == 'b']

   name  age     city
1  nick   21  bandung

### Manipulate DataFrame

In [179]:
data_df = {'Customer':['tom', 'nick', 'krish', 'jack', 'jack', 'tom', 'jack', 'krish', 'nick', 'nick'],
          'Origin':['Tebet', 'Gondangdia', 'Mampang', 'SCBD', 'SCBD', 'Kuningan', 'Pancoran', 'Tebet', 'Mampang', 'Tebet'],
          'Destination':['Gondangdia', 'Mampang', 'SCBD', 'Kuningan', 'Pancoran', 'Pancoran', 'Mampang', 'SCBD', 'SCBD', 'Kuningan'],
          'Distance': [4.5, 5.0, 3.0, 4.8, 2.2, 4.7, 3.4, 4.0, 2.2, 2.9],
          'Price': [20000, 23000, 14000, 24500, 7000, 20000, 15000, 18500, 9000, 11000]}
          
df = pd.DataFrame(data_df)

df

  Customer      Origin Destination  Distance  Price
0      tom       Tebet  Gondangdia       4.5  20000
1     nick  Gondangdia     Mampang       5.0  23000
2    krish     Mampang        SCBD       3.0  14000
3     jack        SCBD    Kuningan       4.8  24500
4     jack        SCBD    Pancoran       2.2   7000
5      tom    Kuningan    Pancoran       4.7  20000
6     jack    Pancoran     Mampang       3.4  15000
7    krish       Tebet        SCBD       4.0  18500
8     nick     Mampang        SCBD       2.2   9000
9     nick       Tebet    Kuningan       2.9  11000

In [192]:
# add column

df['Rate'] = df['Price'] / df['Distance']

In [193]:
df

  Customer      Origin Destination  Distance  Price         Rate
0      tom       Tebet  Gondangdia       4.5  20000  4444.444444
1     nick  Gondangdia     Mampang       5.0  23000  4600.000000
2    krish     Mampang        SCBD       3.0  14000  4666.666667
3     jack        SCBD    Kuningan       4.8  24500  5104.166667
4     jack        SCBD    Pancoran       2.2   7000  3181.818182
5      tom    Kuningan    Pancoran       4.7  20000  4255.319149
6     jack    Pancoran     Mampang       3.4  15000  4411.764706
7    krish       Tebet        SCBD       4.0  18500  4625.000000
8     nick     Mampang        SCBD       2.2   9000  4090.909091
9     nick       Tebet    Kuningan       2.9  11000  3793.103448

In [194]:
# remove column

df = df.drop(columns=['Rate'])

In [195]:
df

  Customer      Origin Destination  Distance  Price
0      tom       Tebet  Gondangdia       4.5  20000
1     nick  Gondangdia     Mampang       5.0  23000
2    krish     Mampang        SCBD       3.0  14000
3     jack        SCBD    Kuningan       4.8  24500
4     jack        SCBD    Pancoran       2.2   7000
5      tom    Kuningan    Pancoran       4.7  20000
6     jack    Pancoran     Mampang       3.4  15000
7    krish       Tebet        SCBD       4.0  18500
8     nick     Mampang        SCBD       2.2   9000
9     nick       Tebet    Kuningan       2.9  11000

In [196]:
# rename column

df = df.rename(columns={'Price': 'Cost',
                        'Distance': 'Distance (Km)'})

df

  Customer      Origin Destination  Distance (Km)   Cost
0      tom       Tebet  Gondangdia            4.5  20000
1     nick  Gondangdia     Mampang            5.0  23000
2    krish     Mampang        SCBD            3.0  14000
3     jack        SCBD    Kuningan            4.8  24500
4     jack        SCBD    Pancoran            2.2   7000
5      tom    Kuningan    Pancoran            4.7  20000
6     jack    Pancoran     Mampang            3.4  15000
7    krish       Tebet        SCBD            4.0  18500
8     nick     Mampang        SCBD            2.2   9000
9     nick       Tebet    Kuningan            2.9  11000

### Describe Dataframe

In [198]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Customer       10 non-null     object
 1   Origin         10 non-null     object
 2   Destination    10 non-null     object
 3   Distance (Km)  10 non-null     float64
 4   Cost           10 non-null     int64
dtypes: float64(1), int64(1), object(3)
memory usage: 528.0+ bytes

In [199]:
df.describe()

       Distance (Km)          Cost
count      10.000000     10.000000
mean        3.670000  16200.000000
std         1.071914   5954.456781
min         2.200000   7000.000000
25%         2.925000  11750.000000
50%         3.700000  16750.000000
75%         4.650000  20000.000000
max         5.000000  24500.000000

### Latihan

#### Latihan 1

In [ ]:
# Coba kalian buat function yang dapat menghitung kemunculan kata pada kalimat

# Input: 2 string --> 'aku' | 'aku adalah anak gembala'
# Output: 1

# for , split , +=

In [ ]:
# 'aku adalah anak gembala'
# ['aku', 'adalah', 'anak', 'gembala']

In [21]:
def hitung_kata(string1, string2):
    words = string2.split()
    total = 0
    
    for word in words:
        if string1 == word:
            total = total + 1
            
    return total

In [22]:
hitung_kata('aku', 'aku adalah anak aku aku')

3

#### Latihan 2

In [86]:
# Coba kalian bikin function untuk kuis yang akan generate random number (1 - 4)

# Input: 1 string (nama)
# Output: "Selamat {nama}! Kamu menang {hadiah}"

prizes = {
    1: "Motor",
    2: "Mobil",
    3: "Lontong",
    4: "10 Juta"
}

def kuis(nama):
    random_number = random.randint(1, 4)
    prize = prizes[random_number]
    
    return "Selamat {}! Kamu menang {}".format(nama, prize)

In [113]:
kuis('roberto')

'Selamat roberto! Kamu menang Lontong'

#### Latihan 3

In [114]:
import time

minute = 1
for i in range(1,300):
    time.sleep(1)
    if i % 60 == 0:
        print('{} menit!'.format(minute), end=' ')
        minute += 1
print('Selesai!!')

1 menit! 2 menit! 3 menit! 4 menit! Selesai!!

In [123]:
# Coba kalian bikin investment calculator
# Kalian bisa lihat investasi kalian pada jangka waktu tertentu dengan bunga

# Input: investasi (int --> uang awal) , waktu (int --> lama dalam bulan) , interest (float --> bunga/bulan)
# Output: nilai investasi akhir

# Input: 10.000.000 , 12 , 1
# Output: 

def investment_calculator(investasi, waktu, bunga, tambahan):
    
    for i in range(waktu):
        interest = investasi * (bunga/100)
        investasi = investasi + interest + tambahan
        
    return investasi

In [124]:
investment_calculator(5000000, 60, 1, 0)

9083483.492820451

In [125]:
investment_calculator(5000000, 60, 1, 500000)

49918318.42102498

### Assignment

In [ ]:
# 1. Coba buat function untuk merubah suhu dari Celcius ke Reamur atau sebaliknya

# Input: 1 string
# Output: 1 string

# Contoh
# Input: '35C'
# Output: '..R'

# Input: '32R'
# Output: '..C'